app/views/posts/_unbookmark.html.erb

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = $1 AND "bookmarks"."post_id" = $2 LIMIT $3  [["user_id", 1755], ["post_id", 998], ["LIMIT", 1]]
---
<%= link_to post_bookmark_path(post, current_user.bookmarks.find_by(post_id: post.id)),
    id: "unbookmark-button-for-post-#{post.id}",
    data: {