app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 103
---
      <h2 class="text-lg font-bold mb-2">コメント一覧</h2>
      <% @post.comments.each do |comment| %>