app/controllers/bookmarks_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 950], ["LIMIT", 1]]
INSERT INTO "bookmarks" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1666], ["post_id", 950], ["created_at", "2025-09-04 09:57:07.381274"], ["updated_at", "2025-09-04 09:57:07.381274"]]
---
	def create
		@post = Post.find(params[:post_id])
		current_user.bookmarks.create(post: @post)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 951], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = $1 AND "bookmarks"."post_id" = $2 LIMIT $3  [["user_id", 1668], ["post_id", 951], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 24]]
---
	def destroy
		@post = Post.find(params[:post_id])
		bookmark = current_user.bookmarks.find_by(post: @post)
		bookmark&.destroy