app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 123], ["LIMIT", 1]]
---
  def set_post
    @post = Post.find(params[:post_id])