app/controllers/facilities_controller.rb

  def search
    @mountain = Mountain.find_by(name: params[:name])

    if @mountain.nil?
      uri = URI("https://maps.googleapis.com/maps/api/place/textsearch/json")
      uri.query = URI.encode_www_form({
        query: "#{params[:name]} スキー場",
        key: ENV["GOOGLE_MAPS_API_KEY"],
        language: "ja"
      })

      response = Net::HTTP.get(uri)
      data = JSON.parse(response)

      if data["status"] == "OK" && data["results"].present?
        place = data["results"].first

        @mountain = Mountain.find_or_initialize_by(place_id: place["place_id"])
        Rails.logger.debug "[DEBUG] 新規作成または取得: #{@mountain.inspect}"
        unless @mountain.update(
          name: place["name"],
          latitude: place["geometry"]["location"]["lat"],
          longitude: place["geometry"]["location"]["lng"],
          address: place["formatted_address"],
          rating: place["rating"],
          user_ratings_total: place["user_ratings_total"]
        )
---
SELECT "mountains".* FROM "mountains" WHERE "mountains"."name" IS NULL LIMIT 1
SELECT "mountains".* FROM "mountains" WHERE "mountains"."place_id" = 'ChIJb_dBmbY-hV8Rnpr8w73ksn8' LIMIT 1
UPDATE "mountains" SET "address" = '日本、〒949-6372 新潟県南魚沼市石打１６５５', "user_ratings_total" = 1965, "updated_at" = '2025-07-31 10:27:05.114318' WHERE "mountains"."id" = 100