app/controllers/mountain_controller.rb

SELECT "mountains".* FROM "mountains" WHERE "mountains"."place_id" = 'ChIJF4y_4ncvi18Rt_qYWpZ-MFQ' LIMIT 1
UPDATE "mountains" SET "address" = '沼田市玉原高原', "user_ratings_total" = 3194, "updated_at" = '2025-07-27 15:53:49.634010' WHERE "mountains"."id" = 33
INSERT INTO "mountains" ("place_id", "name", "latitude", "longitude", "address", "rating", "user_ratings_total", "created_at", "updated_at") VALUES ('ChIJF4y_4ncvi18Rt_qYWpZ-MFQ', 'ニノックススノーパーク', 37.9268164, 139.4679026, '新発田市上三光 大平国有林無番地', 3.7, 416, '2025-07-24 15:20:22.988216', '2025-07-24 15:20:22.988216') RETURNING "id"
---
  def search
    if params[:area].present?
      lat, lng = GeocodingService.new(params[:area]).coordinates

      if lat && lng
        places = GooglePlacesService.new(lat: lat, lng: lng, keyword: "スキー場").search

        @results = []

        places["results"].each do |place|
          next unless place["place_id"] && place["geometry"] && place["geometry"]["location"]

          mountain = Mountain.find_or_initialize_by(place_id: place["place_id"])
          unless mountain.update(
            name: place["name"],
            latitude: place["geometry"]["location"]["lat"],
            longitude: place["geometry"]["location"]["lng"],
            address: place["vicinity"],
            rating: place["rating"],
            user_ratings_total: place["user_ratings_total"]
          )
            Rails.logger.debug "保存失敗: #{mountain.errors.full_messages}"
          end

          @results << mountain