app/controllers/posts_controller.rb

  def index
    @q = Post.ransack(params[:q])
    @posts = @q.result.includes(:user)
---
SELECT "posts".* FROM "posts"
SELECT "users".* FROM "users" WHERE "users"."id" IN (1, 2)

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES ('aaaaaa', 'aaaaaaaaa', '2025-07-26 14:16:00.319167', '2025-07-26 14:16:00.319167', 6) RETURNING "id"

  def update
    @post = Post.find(params[:id])
    unless @post.user == current_user
      redirect_to @post, alert: "他人の投稿は編集できません"
      return
    end

    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 153], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "更新タイトル"], ["updated_at", "2025-07-26 14:54:19.802698"], ["id", 153]]

  def search
    @q = Post.ransack(params[:q])
    @posts = @q.result.includes(:user)
---
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 499], ["id", 257]]

  def bookmarks
    @bookmarks = current_user.bookmarked_posts.includes(:user)
---
SELECT "posts".* FROM "posts" INNER JOIN "bookmarks" ON "posts"."id" = "bookmarks"."post_id" WHERE "bookmarks"."user_id" = $1  [["user_id", 1694]]