app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES ('aaaaaa', 'aaaaaaaaa', '2025-07-26 14:16:00.319167', '2025-07-26 14:16:00.319167', 6) RETURNING "id"