app/controllers/profiles_controller.rb

  def update
    @user = current_user

    # まず icon_image が params にあるかチェック
    icon_image_attaching = user_params[:icon_image].present?

    if @user.update(user_params)
---
UPDATE "users" SET "name" = 'taisei23', "updated_at" = '2025-07-31 07:49:32.181536' WHERE "users"."id" = 6